/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstadd_front.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: myoh <myoh@student.42seoul.kr>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/31 14:18:24 by myoh              #+#    #+#             */
/*   Updated: 2020/10/31 21:48:36 by myoh             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_lstadd_front(t_list **upc, t_list *new)
{
	if (!*upc || !new || !upc)
		return ;
	else 
	{
		new->next = *upc; //노드 1 연결
		*upc = new; //시작노드는 new가 됨
	}
}
